const keywords = {
  "자동차": ["현대차", "기아", "현대모비스", "한국GM", "KG모빌리티", "르노코리아", "볼보", "BMW", "폭스바겐", "BYD", "SDV", "자율주행"],
  "물류": ["대한통운", "롯데글로벌로지스", "HMM", "현대글로비스", "LX판토스", "한진", "팬스타", "콜드체인"],
  "로봇": ["뉴로메카", "엔젤로보틱스", "레인보우로보틱스", "유진로봇", "두산로보틱스", "보스턴다이내믹스", "협동로봇", "휴머노이드"],
  "철강": ["포스코", "현대제철", "KG스틸", "세아홀딩스", "동국제강"],
  "비철금속": ["고려아연", "영풍", "풍산"],
  "전력기기": ["HD현대일렉트릭", "LS일렉트릭", "효성중공업"],
  "에너지": ["두산에너빌리티", "GS칼텍스", "SK이노베이션", "S-OIL"],
  "화학소재": ["한화솔루션", "OCI", "DL케미칼", "LG화학", "금호석유화학"]
};
